{
  "homepage": "https://www.curseforge.com/minecraft/mc-mods/armorplus",
  "promos": {
    "1.10.2-latest": "1.10.2-8.7.1.2",
    "1.10.2-recommended": "1.10.2-8.7.1.2",
    "1.11-latest": "1.11.2-10.8.0.1",
    "1.11-recommended": "1.11.2-10.8.0.1",
    "1.11.2-latest": "1.11.2-10.8.0.1",
    "1.11.2-recommended": "1.11.2-10.8.0.1",
    "1.12-latest": "1.12-11.5.1.16-alpha",
    "1.12-recommended": "1.12-11.5.1.16-alpha",
    "1.12.1-latest": "1.12.1-11.6.4.21-alpha",
    "1.12.1-recommended": "1.12.1-11.6.4.21-alpha",
    "1.12.2-latest": "1.16.3-16.0.0.1",
    "1.12.2-recommended": "1.16.3-16.0.0.1",
    "1.16.3-latest": "1.16.3-16.0.0.1",
    "1.16.3-recommended": "1.16.3-16.0.0.1"
  },
  "1.10.2": {
    "1.10.2-8.0.1.7": "Quick Fix, Server Crash Issue",
    "1.10.2-8.0.2.8": "Added a few more configuration options",
    "1.10.2-8.0.3.9": "Fixed crash using the ArmorPlus book",
    "1.10.2-8.0.4.10": "Fixed Super Star Armor Regeneration not working properly",
    "1.10.2-8.0.5.11": "Fixed Wrong Config Information, functionality & added description to some items in JEI",
    "1.10.2-8.1.0.1": "Added more Config Options, Fixed some broken ones, fixed some more stuffs and tweaked a bit the tinkers' integration",
    "1.10.2-8.2.0.1": "Nerfed all the armors (Balancing the ridiculously OP armors), requires config to be deleted",
    "1.10.2-8.2.1.2": "Fixed The Gift OF The Gods having unlimited uses on servers",
    "1.10.2-8.2.2.3": "Updated forge version and mappings dependencies, fixed some issues with TGOTG",
    "1.10.2-8.2.3.4": "Fixed some more issues with TGOTG (server side) and added a little warning to it that it can be dangerous",
    "1.10.2-8.2.4.5": "Fixed some issues with latest JEI",
    "1.10.2-8.3.0.1": "Added MineTweaker Integration to all the benches, updated benches model and way of placement to the newer ones",
    "1.10.2-8.4.0.1": "Introducing Hellish Mode (2), un-repairable items, weapons and armors.",
    "1.10.2-8.4.1.2": "Prevented crashes while trying to read more information for items and armors.",
    "1.10.2-8.5.0.1": "Improved performance, fixed bugs, crashes, improved reliability, fixed compatibility issues, updated dependencies and now depends on thedragonlib-1.10.2-1.0.3.1",
    "1.10.2-8.5.1.2": "Fixed uncraftable High-Tech Bench",
    "1.10.2-8.5.2.3": "Fixed a bug causing an unlimited use of TGOTG and added the ability to enable/disable mod drops added by A+ via config",
    "1.10.2-8.5.3.4": "Fixed Night vision being annoying and some performance fixes",
    "1.10.2-8.5.4.5": "Fixes wrong information inside the ArmorPlus abilities book",
    "1.10.2-8.6.0.1": "Fixed changing gamemodes/recipes crashing the game, some recipes not working, Enchantment issues, language files, commands and added 2 new gamemodes, disabled recipes and hellish (items can't be repaired)",
    "1.10.2-8.6.1.2": "Fixed server crash on loading",
    "1.10.2-8.7.0.1": "Added some blocks (lava crystal and charged lava crystal), renamed the lava crystal ore to Lava Crystal Ore (from Block Lava Crystal) and fixed a few bugs and a broken recipe",
    "1.10.2-8.7.1.2": "Fixed full set abilities not working on pretty much any armors"
  },
  "1.11": {
    "1.11-9.0.0.1-alpha": "Port to 1.11",
    "1.11-9.1.0.1-beta": "Fixed & Added Crafting Recipes, re-added benches (maybe temporally), fixed some bugs, tweaked some minor things, added a WIP new Game Mode for recipes (Hellish | 2)",
    "1.11-9.1.1.2-beta": "Fixes castles spawning everywhere",
    "1.11-9.2.0.1-beta": "Added Champion Bench (WIP | Special), fixed recipes (In-Game, soon documentation), fixed some other minor bugs and some really rare crashes. Added some more WIP stuffs",
    "1.11-9.3.0.1-beta": "Fixed Server crash on start up. Added JEI integration.",
    "1.11-9.3.1.2-beta": "Made Lava Crystals harder to find with rarity from 7 rarity to 8 and Vein Amounts from 5 to 2",
    "1.11.2-9.4.0.1-beta": "More control over world gen, new dungeon, port to 1.11.2 and now Requires TheDragonLib 1.11.2-2.1.0"
  },
  "1.11.2": {
    "1.11.2-9.4.0.1-beta": "More control over world gen, new dungeon, port to 1.11.2 and now Requires TheDragonLib 1.11.2-2.1.0",
    "1.11.2-9.4.1.2-beta": "Fixed Uncraftable High-Tech Bench leading to uncraftable recipes",
    "1.11.2-9.5.0.1-beta": "new block lava infuser (no model yet, heh sorry...) and some changes recipes and fixed some important bugs (such as mob drops)",
    "1.11.2-9.5.1.2-beta": "Fixed uncraftable Lava Infuser (Added a recipe for it) and added JEI integration",
    "1.11.2-9.5.2.3-beta": "Fixed unregistered recipes (sorry about that)",
    "1.11.2-9.5.3.4-beta": "Fixed some bugs, (more info in the changelog) and now depends on thedragonlib-1.11.2-2.2.3",
    "1.11.2-9.5.4.5-beta": "Fixed lava crystal issues.",
    "1.11.2-9.5.5.6-beta": "Fixed bow related issues, finally (hopefully).",
    "1.11.2-9.5.6.7-beta": "Fixed Mob drops in the ArmorPlus towers.",
    "1.11.2-9.5.7.8-beta": "Prevented crashes while trying to read more information for items and armors.",
    "1.11.2-10.0.0.1": "There are major changes, for a TL;DR its best to read the changelog provided at the link of the released file https://minecraft.curseforge.com/projects/armorplus/files/2386664",
    "1.11.2-10.0.1.2": "Fixed crash when trying to look up some items in JEI",
    "1.11.2-10.0.2.3": "Fixed a crash when using some items in-game",
    "1.11.2-10.0.3.4": "Warn if the player don't have Forgelin installed",
    "1.11.2-10.1.0.1": "Some balance changes on armors and weapons, and some config changes. for more info check the mod changelog",
    "1.11.2-10.1.1.2": "Fixed potential Tile Entity crashes in interaction with other mods",
    "1.11.2-10.1.2.3": "Hopefully fully fixes crashes with Tile Entity interactions",
    "1.11.2-10.2.0.1": "Added some blocks (lava crystal and infused lava crystal), renamed the lava crystal ore to Lava Crystal Ore (from Block Lava Crystal), Rapairing now works properly on everything, fixed a bug with enchant levels, added a config option to disable the lava debuffs completely and some bug fixes",
    "1.11.2-10.2.1.2": "Fixed a bug causing game crashes when changing weapons' registry config values",
    "1.11.2-10.3.0.1": "Fixed TGOTG not working on multiplayer, Added Tinkers Integration (reworked a bit, still WIP), added CT support for the Lava Infuser",
    "1.11.2-10.3.1.2": "Fixes Tinkers' Construct integration issues and improved/tweaked the integration as well",
    "1.11.2-10.3.2.3": "Fixed a crash when changing some armors' registry values (when disabling them)",
    "1.11.2-10.4.0.1": "Fixed registry crashes, life steal has now restrictions on where it can be applied, fixed values, tabs and other minor bugs",
    "1.11.2-10.4.1.2": "Fixed full set abilities not working on pretty much any armors, introduced 2 new blocks and updated the JEI integration",
    "1.11.2-10.5.0.1": "Switched to the NodeCDN and added analytics",
    "1.11.2-10.5.1.2": "Fixed server side crash and added a config value ModPackID for TheDragonTeam ModPack Partner Program ID",
    "1.11.2-10.5.2.3": "Added the ability to enable/disable energy items via config and updated ru_ru.lang",
    "1.11.2-10.8.0.1": "Improved a few bits of code here and there, hopefully improves the performance a bit, now requires TheDragonLib 1.11.2-3.3.0"
  },
  "1.12": {
    "1.12-11.0.0.1-alpha": "",
    "1.12-11.0.1.2-alpha": "",
    "1.12-11.2.0.5-alpha": "",
    "1.12-11.3.0.7-alpha": "",
    "1.12-11.3.1.8-alpha": "",
    "1.12-11.3.2.9-alpha": "",
    "1.12-11.3.3.10-alpha": "",
    "1.12-11.3.4.11-alpha": "",
    "1.12-11.3.5.12-alpha": "",
    "1.12-11.3.6.13-alpha": "",
    "1.12-11.4.0.14-alpha": "",
    "1.12-11.5.0.15-alpha": "",
    "1.12-11.5.1.16-alpha": ""
  },
  "1.12.1": {
    "1.12.1-11.6.0.17-alpha": "",
    "1.12.1-11.6.1.18-alpha": "",
    "1.12.1-11.6.2.19-alpha": "",
    "1.12.1-11.6.3.20-alpha": "",
    "1.12.1-11.6.4.21-alpha": ""
  },
  "1.12.2": {
    "1.12.2-11.7.0.22-beta": "",
    "1.12.2-11.7.1.23-beta": "",
    "1.12.2-11.7.2.24-beta": "",
    "1.12.2-11.8.0.26-beta": "Releases are now beta, Updated to 1.12.2, Workbenches are back, and MANY MANY other change since last changelog, please check the full changelog here: https://github.com/TheDragonTeam/ArmorPlus/blob/1.12/src/main/resources/changelog.md",
    "1.12.2-11.8.1.27-beta": "",
    "1.12.2-11.8.2.28-beta": "",
    "1.12.2-11.8.3.29-beta": "",
    "1.12.2-11.9.0.30-beta": "",
    "1.12.2-11.9.1.31-beta": "",
    "1.12.2-11.9.2.32-beta": "",
    "1.12.2-11.9.3.33-beta": "",
    "1.12.2-11.10.0.34-beta": "",
    "1.12.2-11.10.1.35-beta": "",
    "1.12.2-11.11.0.36-beta": "",
    "1.12.2-11.11.1.37-beta": "",
    "1.12.2-11.12.0.38-beta": "",
    "1.12.2-11.12.1.39-beta": "",
    "1.12.2-11.13.0.40": "Many changes since last changelog, finally a release.",
    "1.12.2-11.13.1.41": "Simplified the way the CraftTweaker scripts are being created in code.\nAdded minHeight and maxHeight to the world gen exception if those values are set incorrect.\nOptimized World Gen slightly.\nAdded a NodeCraft command.\nUpdated localization entries for the commands, to include modid (*this has been updated to the relative languages*).\nUpdated Tile Entity registration to use the ResourceLocation version instead of the string version.\nNow requires TheDragonLib 1.12.2-5.3.0",
    "1.12.2-11.14.0.42": "\nOptimizations.\nBugs Fixed:\n* Fixed being unable to repair tconstruct armors\n* Fixed being unable to get the full set effect of the cobalt armor.",
    "1.12.2-11.16.0.45": "Fixed some bugs related to invalid config values, potions are now grouped in the config file, fixed a bug where amplifier was being set with the duration values.",
    "1.12.2-11.16.1.46": "Fixed Update checker, Cosmetics and a few under the scene bugs. Also no longer associated with TheDragonTeam.",
    "1.12.2-11.16.2.47": "Fixed a lot of bugs related to crafting, especially items getting voided when exiting the gui.",
    "1.12.2-11.16.3.48": "MAJOR FIX, fixed blocks being unbreakable... also adds config values that you can change for block's harvest properties (registry.cfg) under blocks.",
    "1.12.2-11.17.0.50": "* Introducing experimental mode **DISABLED BY DEFAULT**, a config value that changes everything about this mod, as the name suggest its EXPERIMENTAL and can cause corruption/destroy/break your worlds.\n  - New way of obtaining abilities, ability limits, quests, and a lot more (WIP)\n  - Once enabled armors' will be revamped, and made so that they will require quests to be done (if any, use with caution) to obtain abilities.\n* A few QoL improvements, moved most of the InGame dialogs to use the translatable key format (now can be translated).\n* Fixed a few bugs related to the Skeletal King, additionally it no longer targets players but also any other type of mob, except Wither Skeletons\n* GUIs:\n  - Re-aligned some grid positions of the crafting GUIs, made them more correctly aligned. \n  - Added armor inventory slots to the crafting GUIs\n  - JEI: Fixed some GUI arrangements\n  - MAJOR: Fixed items getting voided from the GUIs",
    "1.12.2-11.17.1.51": "Fixed CraftTweaker recipes being broken.",
    "1.12.2-11.18.0.52": "* Slowly migrating towards the new Ability System. Migration will be done in **1.13**.\n* Made a registry that other mods can use to implement their own abilities.\n  - Ability Registry - the registry where people can register their own abilities.\n  - AbilityData - the class mods will need to extend and implement with mod-provided methods, if something is missing contact me to add more stuff.\n  - ImplementedAbilities - all the implemented abilities by ArmorPlus\n  - Made the ability names translatable\n* Introducing abilities: Walk on Lava, Bonus XP on Kill, Wither-Proof, Potion Abilities",
    "1.12.2-11.19.0.53": "* Localized the majority of the mod\n* Fixed the special bows not working correctly with infinity and creative mode.\n* Fixed special bows getting consumed if the arrow is placed in the off-hand slot \n* Fixed MAJOR performance lose because of the Skeletal King.\n* Fixes for TGOTG (The Gift of The Gods) \n  - Blacklist should now work correctly\n  - Made it look through the Item registry instead of the numeric id system.\n* Added Textures to the prototypes (corresponding to the original ones)\n* Battle axes can now disable shields\n* Overhauled some of the textures for:\n  - Arrows (16x16->32x32)\n  - Battle Axes (16x16->64x64) - Rescaled Third-person View\n  - Swords (16x16->64x64) - Rescaled Third-person View\n* A few performance fixes and QoL improvements\n* Commands with links now properly display information and do NOT open the link immediately. \n* _Added more bugs_",
    "1.12.2-11.19.1.54": "* Made a lot of null-checks for the ability usages, should respect their uses\n* Fixed capability conflicts causing issues (mainly crashes)",
    "1.12.2-11.19.2.55": "* Reworked a bit the ability system even more, its no longer only for ItemArmorV2 but any item that implements ISpecialItem\n",
    "1.12.2-11.20.0.56": "* Internal changes made to registries\n  - You can no longer fully remove an item from the registry. \n  - Use another methods to stop the ability of getting such items (like removal of its recipes) \n  - Why? \n    ~ This is done to firstly have \"safe\" items, as well as optimization towards the registry handling.\n    ~ Items/Blocks/Entities shouldn't be fully removed, only made unobtainable.\n  - Notes:\n    ~ The config options will be gone, but they will not remove themselves from the registry.cfg.\n    ~ Only affects item registration (Experimental Mode still removes/adds the experimental items). Recipes can still be enabled/disabled, by both configs and/or CraftTweaker.\n    ~ JEI: these items will always show in JEI even if unobtainable, if you want to change that JEI provides options to hide those items.\n* TOP Recipes should now save old NBT data.",
    "1.12.2-11.21.0.57": "* Draconic Evolution integration.\n  - Armors can now negate CHAOS damage\n    ~ Super Star Armor <chest> (90%) \n    ~ Guardian Armor <chest> (90%)\n    ~ Ender Dragon Armor <chest> (90%)\n    ~ Ultimate Armor <chest> (100%, Immune to the Chaos dragon damage)\n  - ToolTip information has been added accordingly\n* Reworded the way the ultimate armor tooltip is displayed on full set\n* Some internal package re-organization\n* Fixed credits link being broken (They deserve 100% of the credits for their contributions)",
    "1.12.2-11.22.0.58": "* Added the \"Enhanced\" enchantment, followed by Enhanced Vanilla Armors, obtainable by enchanting a vanilla armor with the \"Enhanced\" enchantment.\n* Fixed a bug causing tinkers' armors not having any recipes.\n* Added Pickaxes corresponding to their material (Coal, Lapis, Redstone, Emerald, Obsidian, Infused Lava, Guardian, Super Star, Ender Dragon)\n* The Ultimate armor can now be enchanted via the Enchanting Table and have enchantment books apply to the armor\n* Informational commands can now be accessed with no permissions.\n* Made use of Forge's new IRarity interface\n* Added a config to disable the chaos immunity for the Ultimate armor\n* Added Swedish translation of the mod\n* Now REQUIRES MINIMUM Forge version 1.12.2-14.23.5.2836",
    "1.12-2-11.23.0.59": "* Fixed errors being spammed on servers when placing down a Trophy or having an old one there. And apparently some rare cases of lag spikes.\n* Made trophy drops default, split the WIP & vanilla bosses into 2 fields.\n* Fixed the localization of the Tools Tab.\n* Made the Skeletal King to explode into 3 small Wither Bosses when defeated.\n* Fixed a crashes related to Enchantment levels being able to be set higher than the intended maximum for the Life Steal & Furious enchantment.\n* Added separate config options that allow to enable/disable the enchantments' functionality, making them useless.\n* Added a 4rth more powerful level of the Furious enchantment\n* Added a new WIP dimension (The Arena), where you can fight important ArmorPlus bosses. Do not load this dimension (id: 120, configurable)\n",
    "1.12.2-11.24.0.60": "* Added Trophies for almost ALL of the Vanilla mobs. (Modifiable by NBT)\n* Some minor performance improvements\n* Fixed a bug causing Tinker Construct Armors not being able to provide abilities.\n* Added a new entity Demonic Dragon (WIP, Dungeon, Boss)\n* Some code optimizations & Tweaks\n  - Moved Models & Renderers under the client packaging\n  - Merged most of the event registry stuff together with their corresponding classes of constants\n  - Removed ItemRemove",
    "1.12.2-11.25.0.61": "* **Recipes**: _The Ultimate Overhaul_\n  - _The Guardian, Super Star & Ender Dragon Weapons_: The recipes have been changed significantly.\n  - Guardian Bow: Fixed recipe being broken.\n  - Infused Lava Arrow: Moved it up a tier, to High-Tech bench from the Workbench, slightly changed requirements.\n  - Arrows: Any arrow tier recipe will always give 8 arrows to the player.\n* **Bows**: Fixed a bug where bow information was incorrectly stating that the bows can give reduced damage values.\n* **Arrows**: Corrected individual arrow damage tooltip, balanced some of the arrows.\n  - Feature: Added the missing arrows from the set, each with its own ability (Emerald, Obsidian, Guardian, Super Star)\n  - Technical: Simplified Arrow addition.\n* **Fragments**: A new WIP item, currently useless.\n* **Enchantments**: Fixed a bug where the level limit for the life steal enchantment could exceed and cause a game crash.\n* **Dimensions**: Added a WIP Dimension called the \"Realm of Insanity\".",
    "1.12.2-11.25.1.62": "* Added Sword Displays: you can now showcase your cool swords ;) for each mod material sword (soon vanilla support)\n  - Recipe requires 3 Stone Slabs & 3 Iron Ingots \n* Added WIP Maps Items: (Maps in a later version of the mod will be used to travel between dimensions with ease)\n  - Map of Overworld\n  - Map of The Nether\n  - Map of The End\n  - Map of The Realm\n  - Map of Sacrifice\n  - Map of Arena\n  - Map of The Shaper\n  - Map of The Elder\n* Fixed a bug where unregistered dimensions crashed the game (I forgot to add a check)",
    "1.12.2-11.26.0.64": "* The arrow pos & texture displayed on the crafting benches got fixed finally..\n* You can now use stacked lava crystals (either infused or normal) in the lava infuser, but only 1 lava bucket.\n* Hard-Disabled all the Dimensions for the [1.12.2] version.\n* Complete overhaul of the textures in the mod. Enjoy a brand new look of the mod :D\n  - Added Textures & Models to the Ender (Dungeon) blocks, yey more decorative blocks.\n    - Ender Pillars - Connectable blocks, that expand if connected vertically together, with a cool-ish model.\n    - Re-designed all the stones, floors, and bricks.\n  - Added textures for the horse armors.\n  - Remade all the main materials in the mod.. to have a more unique and special look.\n  - Remade all of the weapon textures, as well as some of the armor textures.\n* Added more Tinkers' material types\n  - Guardian, Ender Dragon, Super Star\n* Added a probably loot table chance for the horse armors to spawns in default vanilla dungeon chests\n* Added Dungeon Spawner Items (right-clickable items that will spawn dungeons with bosses in them).\n  - They do not work as intended atm (all spawn the same structure).\n* Updated the French (fr_fr.lang) translation thanks to [Poke](https://github.com/antoinegag).\n* Updated the textures for the sword displays.",
    "1.12.2-11.26.1.65": "* Updated JEI & CraftTweaker integrations\n  - Remove recipe (ItemStack) should now work as intended.\n* Added config options\n  - Added the ability to enable/disable the steel and electrical ingot recipes.\n",
    "1.12.2-11.26.2.66": "* Fixed Craft Tweaker's (Remove) function.\n  - To remove items like crafting a Steel Ingot, you will need to remove its recipes twice.. (you remove each recipe it has individually)\n     - Steel Ingot has 2 recipes, one for its block recipe and one for itself.\n     \n* Infused Lava Pickaxe no longer uses the Lava Infuser's infusing registry.\n  - Added the following blocks to the forbidden from smelting list: Sponge, Wet Sponge, Obsidian\n  - Added a config entry for the forbidden list. ",
    "1.12.2-11.26.3.67": "**QUICK FIX**\n* Tinkers' Construct Integration\n  - Added Trails for each of the tier 3 materials\n    - Guardian: Aquadynamic, Alien, Depthdigger\n    - Super Star: Aridiculous, Alien, Hellish\n    - Ender Dragon: Enderference, Alien, Cold-Blooded \n  - Added 3 config options that allow you to disable/enable each material individually (guardian scale, wither bone, ender dragon scale).\n",
    "1.12.2-11.27.0.68": "* Added repair materials for the pickaxes. (the material is the same, as the one used for other tools/armors/weapons of the same type)\n* Added repair materials for the enhanced vanilla armors. (matching the vanilla ones)\n* Fragments (of Sacrifice) got usage:\n  - The 4 Fragments can be combined into the \"Map of Sacrifice\". (Works in any bench, shapeless)\n  - Added a tooltip that indicates how they can be obtained.\n* Map of Sacrifice:\n  - Can now be used to spawn, the one, the only, The Skeletal King\n    - Skeletal King Stats: (1200 Health, 8 Armor)\n       - Shoots wither spawners (they summon witherlings, each witherling gets stronger after defeating % of the Skeletal King's HP)\n       - Buffs: Wither Immunity, Resistance I\n       - Summons 5 Blazes on death\n       - Drops: 2-3 Nether Stars, 1-2 Wither Bones\n* Added more localization key entries sets\n  - One of the sets is for TGOTG (The Gift Of The Gods) (Yes, their tooltips can now be translated)\n  - Maps, Fragments.",
    "1.12.2-11.28.0.69": "**\\[LAST UPDATE FOR 1.12.2, unless there are issues that need to be resolved! Report Issues Here: [Issues](https://github.com/sokratis12GR/ArmorPlus) \\]**\n\n**IMPORTANT UPDATE**\n\n**QUICK FIX**\n* Entity Iron Golems now will drop the DUSK sacrifice fragment.\n* Sword displays should now be function, they will no longer eat your swords, also they now support all types of that extend ItemSword and can be rotated.\n    * Added a few extra \"swords\" on the list, that includes the draconic evolution swords, tconstruct different sword variants and project e swords.\n* The Skeletal King's Health is now 1024 (the max possible health pool for minecraft mobs)\n    * Adjusted the entity health/difficulty for the minion spawns accordingly.\n",
    "1.16.3-16.0.0.1": "Temporary Announcement: ArmorPlus has a beta out for MC Forge 1.16.3!"
  },
  "1.16.3": {
    "1.16.3-16.0.0.1": "Initial 1.16.3 release, for more info see the changelog file at: https://github.com/sokratis12GR/ArmorPlus/blob/1.16.3/src/main/resources/changelog.md",
  }
}
