{
  "homepage": "https://minecraft.curseforge.com/projects/armorplus/files",
  "promos": {
    "1.10.2-latest": "1.10.2-8.7.1.2",
    "1.10.2-recommended": "1.10.2-8.7.1.2",
    "1.11-latest": "1.11.2-10.8.0.1",
    "1.11-recommended": "1.11.2-10.8.0.1",
    "1.11.2-latest": "1.11.2-10.8.0.1",
    "1.11.2-recommended": "1.11.2-10.8.0.1",
    "1.12-latest": "1.12-11.5.1.16-alpha",
    "1.12-recommended": "1.12-11.5.1.16-alpha",
    "1.12.1-latest": "1.12.1-11.6.4.21-alpha",
    "1.12.1-recommended": "1.12.1-11.6.4.21-alpha",
    "1.12.2-latest": "1.12.2-11.16.0.45",
    "1.12.2-recommended": "1.12.2-11.16.0.45"
  },
  "1.10.2": {
    "1.10.2-8.0.1.7": "Quick Fix, Server Crash Issue",
    "1.10.2-8.0.2.8": "Added a few more configuration options",
    "1.10.2-8.0.3.9": "Fixed crash using the ArmorPlus book",
    "1.10.2-8.0.4.10": "Fixed Super Star Armor Regeneration not working properly",
    "1.10.2-8.0.5.11": "Fixed Wrong Config Information, functionality & added description to some items in JEI",
    "1.10.2-8.1.0.1": "Added more Config Options, Fixed some broken ones, fixed some more stuffs and tweaked a bit the tinkers' integration",
    "1.10.2-8.2.0.1": "Nerfed all the armors (Balancing the ridiculously OP armors), requires config to be deleted",
    "1.10.2-8.2.1.2": "Fixed The Gift OF The Gods having unlimited uses on servers",
    "1.10.2-8.2.2.3": "Updated forge version and mappings dependencies, fixed some issues with TGOTG",
    "1.10.2-8.2.3.4": "Fixed some more issues with TGOTG (server side) and added a little warning to it that it can be dangerous",
    "1.10.2-8.2.4.5": "Fixed some issues with latest JEI",
    "1.10.2-8.3.0.1": "Added MineTweaker Integration to all the benches, updated benches model and way of placement to the newer ones",
    "1.10.2-8.4.0.1": "Introducing Hellish Mode (2), un-repairable items, weapons and armors.",
    "1.10.2-8.4.1.2": "Prevented crashes while trying to read more information for items and armors.",
    "1.10.2-8.5.0.1": "Improved performance, fixed bugs, crashes, improved reliability, fixed compatibility issues, updated dependencies and now depends on thedragonlib-1.10.2-1.0.3.1",
    "1.10.2-8.5.1.2": "Fixed uncraftable High-Tech Bench",
    "1.10.2-8.5.2.3": "Fixed a bug causing an unlimited use of TGOTG and added the ability to enable/disable mod drops added by A+ via config",
    "1.10.2-8.5.3.4": "Fixed Night vision being annoying and some performance fixes",
    "1.10.2-8.5.4.5": "Fixes wrong information inside the ArmorPlus abilities book",
    "1.10.2-8.6.0.1": "Fixed changing gamemodes/recipes crashing the game, some recipes not working, Enchantment issues, language files, commands and added 2 new gamemodes, disabled recipes and hellish (items can't be repaired)",
    "1.10.2-8.6.1.2": "Fixed server crash on loading",
    "1.10.2-8.7.0.1": "Added some blocks (lava crystal and charged lava crystal), renamed the lava crystal ore to Lava Crystal Ore (from Block Lava Crystal) and fixed a few bugs and a broken recipe",
    "1.10.2-8.7.1.2": "Fixed full set abilities not working on pretty much any armors"
  },
  "1.11": {
    "1.11-9.0.0.1-alpha": "Port to 1.11",
    "1.11-9.1.0.1-beta": "Fixed & Added Crafting Recipes, re-added benches (maybe temporally), fixed some bugs, tweaked some minor things, added a WIP new Game Mode for recipes (Hellish | 2)",
    "1.11-9.1.1.2-beta": "Fixes castles spawning everywhere",
    "1.11-9.2.0.1-beta": "Added Champion Bench (WIP | Special), fixed recipes (In-Game, soon documentation), fixed some other minor bugs and some really rare crashes. Added some more WIP stuffs",
    "1.11-9.3.0.1-beta": "Fixed Server crash on start up. Added JEI integration.",
    "1.11-9.3.1.2-beta": "Made Lava Crystals harder to find with rarity from 7 rarity to 8 and Vein Amounts from 5 to 2",
    "1.11.2-9.4.0.1-beta": "More control over world gen, new dungeon, port to 1.11.2 and now Requires TheDragonLib 1.11.2-2.1.0"
  },
  "1.11.2": {
    "1.11.2-9.4.0.1-beta": "More control over world gen, new dungeon, port to 1.11.2 and now Requires TheDragonLib 1.11.2-2.1.0",
    "1.11.2-9.4.1.2-beta": "Fixed Uncraftable High-Tech Bench leading to uncraftable recipes",
    "1.11.2-9.5.0.1-beta": "new block lava infuser (no model yet, heh sorry...) and some changes recipes and fixed some important bugs (such as mob drops)",
    "1.11.2-9.5.1.2-beta": "Fixed uncraftable Lava Infuser (Added a recipe for it) and added JEI integration",
    "1.11.2-9.5.2.3-beta": "Fixed unregistered recipes (sorry about that)",
    "1.11.2-9.5.3.4-beta": "Fixed some bugs, (more info in the changelog) and now depends on thedragonlib-1.11.2-2.2.3",
    "1.11.2-9.5.4.5-beta": "Fixed lava crystal issues.",
    "1.11.2-9.5.5.6-beta": "Fixed bow related issues, finally (hopefully).",
    "1.11.2-9.5.6.7-beta": "Fixed Mob drops in the ArmorPlus towers.",
    "1.11.2-9.5.7.8-beta": "Prevented crashes while trying to read more information for items and armors.",
    "1.11.2-10.0.0.1": "There are major changes, for a TL;DR its best to read the changelog provided at the link of the released file https://minecraft.curseforge.com/projects/armorplus/files/2386664",
    "1.11.2-10.0.1.2": "Fixed crash when trying to look up some items in JEI",
    "1.11.2-10.0.2.3": "Fixed a crash when using some items in-game",
    "1.11.2-10.0.3.4": "Warn if the player don't have Forgelin installed",
    "1.11.2-10.1.0.1": "Some balance changes on armors and weapons, and some config changes. for more info check the mod changelog",
    "1.11.2-10.1.1.2": "Fixed potential Tile Entity crashes in interaction with other mods",
    "1.11.2-10.1.2.3": "Hopefully fully fixes crashes with Tile Entity interactions",
    "1.11.2-10.2.0.1": "Added some blocks (lava crystal and infused lava crystal), renamed the lava crystal ore to Lava Crystal Ore (from Block Lava Crystal), Rapairing now works properly on everything, fixed a bug with enchant levels, added a config option to disable the lava debuffs completely and some bug fixes",
    "1.11.2-10.2.1.2": "Fixed a bug causing game crashes when changing weapons' registry config values",
    "1.11.2-10.3.0.1": "Fixed TGOTG not working on multiplayer, Added Tinkers Integration (reworked a bit, still WIP), added CT support for the Lava Infuser",
    "1.11.2-10.3.1.2": "Fixes Tinkers' Construct integration issues and improved/tweaked the integration as well",
    "1.11.2-10.3.2.3": "Fixed a crash when changing some armors' registry values (when disabling them)",
    "1.11.2-10.4.0.1": "Fixed registry crashes, life steal has now restrictions on where it can be applied, fixed values, tabs and other minor bugs",
    "1.11.2-10.4.1.2": "Fixed full set abilities not working on pretty much any armors, introduced 2 new blocks and updated the JEI integration",
    "1.11.2-10.5.0.1": "Switched to the NodeCDN and added analytics",
    "1.11.2-10.5.1.2": "Fixed server side crash and added a config value ModPackID for TheDragonTeam ModPack Partner Program ID",
    "1.11.2-10.5.2.3": "Added the ability to enable/disable energy items via config and updated ru_ru.lang",
    "1.11.2-10.8.0.1": "Improved a few bits of code here and there, hopefully improves the performance a bit, now requires TheDragonLib 1.11.2-3.3.0"
  },
  "1.12": {
    "1.12-11.0.0.1-alpha": "",
    "1.12-11.0.1.2-alpha": "",
    "1.12-11.2.0.5-alpha": "",
    "1.12-11.3.0.7-alpha": "",
    "1.12-11.3.1.8-alpha": "",
    "1.12-11.3.2.9-alpha": "",
    "1.12-11.3.3.10-alpha": "",
    "1.12-11.3.4.11-alpha": "",
    "1.12-11.3.5.12-alpha": "",
    "1.12-11.3.6.13-alpha": "",
    "1.12-11.4.0.14-alpha": "",
    "1.12-11.5.0.15-alpha": "",
    "1.12-11.5.1.16-alpha": ""
  },
  "1.12.1": {
    "1.12.1-11.6.0.17-alpha": "",
    "1.12.1-11.6.1.18-alpha": "",
    "1.12.1-11.6.2.19-alpha": "",
    "1.12.1-11.6.3.20-alpha": "",
    "1.12.1-11.6.4.21-alpha": ""
  },
  "1.12.2": {
    "1.12.2-11.7.0.22-beta": "",
    "1.12.2-11.7.1.23-beta": "",
    "1.12.2-11.7.2.24-beta": "",
    "1.12.2-11.8.0.26-beta": "Releases are now beta, Updated to 1.12.2, Workbenches are back, and MANY MANY other change since last changelog, please check the full changelog here: https://github.com/TheDragonTeam/ArmorPlus/blob/1.12/src/main/resources/changelog.md",
    "1.12.2-11.8.1.27-beta": "",
    "1.12.2-11.8.2.28-beta": "",
    "1.12.2-11.8.3.29-beta": "",
    "1.12.2-11.9.0.30-beta": "",
    "1.12.2-11.9.1.31-beta": "",
    "1.12.2-11.9.2.32-beta": "",
    "1.12.2-11.9.3.33-beta": "",
    "1.12.2-11.10.0.34-beta": "",
    "1.12.2-11.10.1.35-beta": "",
    "1.12.2-11.11.0.36-beta": "",
    "1.12.2-11.11.1.37-beta": "",
    "1.12.2-11.12.0.38-beta": "",
    "1.12.2-11.12.1.39-beta": "",
    "1.12.2-11.13.0.40": "Many changes since last changelog, finally a release.",
    "1.12.2-11.13.1.41": "Simplified the way the CraftTweaker scripts are being created in code.\nAdded minHeight and maxHeight to the world gen exception if those values are set incorrect.\nOptimized World Gen slightly.\nAdded a NodeCraft command.\nUpdated localization entries for the commands, to include modid (*this has been updated to the relative languages*).\nUpdated Tile Entity registration to use the ResourceLocation version instead of the string version.\nNow requires TheDragonLib 1.12.2-5.3.0",
    "1.12.2-11.14.0.42": "\nOptimizations.\nBugs Fixed:\n* Fixed being unable to repair tconstruct armors\n* Fixed being unable to get the full set effect of the cobalt armor."
    "1.12.2-11.16.0.45": "Fixed some bugs related to invalid config values, potions are now grouped in the config file, fixed a bug where amplifier was being set with the duration values.\nPlease check the full changelog here: https://github.com/sokratis12GR/ArmorPlus/blob/1.12/src/main/resources/changelog.md"
  }
}
